In [5]:
import pandas as pd
df_credit = pd.read_csv('https://www.littledataman.com/samples/credit.csv', parse_dates = ['Approval Date'])
df_cards = pd.read_csv('https://www.littledataman.com/samples/cards.csv', parse_dates = ['Effective Date'])
df_trans = pd.read_csv('https://www.littledataman.com/samples/transactions.csv', parse_dates = ['Date'])

In [2]:
df_credit

,First Name,Last Name,Credit Score,Credit Approval,Card Name,Income,Approval Date
0,Jacky,White,825,True,Infinite,155000.62,2019-09-13 12:00:00
1,Jane,Nize,810,True,Golden,120800.88,2019-08-16 05:25:00
2,Henry,Tone,780,True,Golden,98000.58,2020-05-06 12:00:00
3,Desmond,Black,750,True,Silver,54000.00,2020-05-01 01:00:00
4,Eileen,Musk,620,False,Dividend,35000.00,NaT

In [3]:
df_credit.shift(1)

,First Name,Last Name,Credit Score,Credit Approval,Card Name,Income,Approval Date
0,NaN,NaN,NaN,NaN,NaN,NaN,NaT
1,Jacky,White,825.0,True,Infinite,155000.62,2019-09-13 12:00:00
2,Jane,Nize,810.0,True,Golden,120800.88,2019-08-16 05:25:00
3,Henry,Tone,780.0,True,Golden,98000.58,2020-05-06 12:00:00
4,Desmond,Black,750.0,True,Silver,54000.00,2020-05-01 01:00:00

In [4]:
df_credit['New Score'] = df_credit['Credit Score'].shift(1)
df_credit

,First Name,Last Name,Credit Score,Credit Approval,Card Name,Income,Approval Date,New Score
0,Jacky,White,825,True,Infinite,155000.62,2019-09-13 12:00:00,NaN
1,Jane,Nize,810,True,Golden,120800.88,2019-08-16 05:25:00,825.0
2,Henry,Tone,780,True,Golden,98000.58,2020-05-06 12:00:00,810.0
3,Desmond,Black,750,True,Silver,54000.00,2020-05-01 01:00:00,780.0
4,Eileen,Musk,620,False,Dividend,35000.00,NaT,750.0

In [6]:
df_trans

  Card Number       Date  Transactions  Amount
0       CN012 2019-09-01             2  356.20
1       CN014 2019-09-01             3  120.50
2       CN015 2019-09-01             1   53.23
3       CN016 2019-09-01             3   25.60
4       CN012 2019-09-02             5  785.00
5       CN015 2019-09-02             2   23.12
6       CN016 2019-09-02             3   28.30
7       CN012 2019-09-03             4   36.90
8       CN014 2019-09-03             2   23.60
9       CN016 2019-09-03             4   43.50

In [7]:
df_trans.sort_values('Card Number', inplace=True)
df_trans

  Card Number       Date  Transactions  Amount
0       CN012 2019-09-01             2  356.20
4       CN012 2019-09-02             5  785.00
7       CN012 2019-09-03             4   36.90
1       CN014 2019-09-01             3  120.50
8       CN014 2019-09-03             2   23.60
2       CN015 2019-09-01             1   53.23
5       CN015 2019-09-02             2   23.12
3       CN016 2019-09-01             3   25.60
6       CN016 2019-09-02             3   28.30
9       CN016 2019-09-03             4   43.50

In [10]:
df_trans['New_trans']=df_trans.groupby(['Card Number'])['Transactions'].shift()
df_trans

  Card Number       Date  Transactions  Amount  New_trans
0       CN012 2019-09-01             2  356.20        NaN
4       CN012 2019-09-02             5  785.00        2.0
7       CN012 2019-09-03             4   36.90        5.0
1       CN014 2019-09-01             3  120.50        NaN
8       CN014 2019-09-03             2   23.60        3.0
2       CN015 2019-09-01             1   53.23        NaN
5       CN015 2019-09-02             2   23.12        1.0
3       CN016 2019-09-01             3   25.60        NaN
6       CN016 2019-09-02             3   28.30        3.0
9       CN016 2019-09-03             4   43.50        3.0

In [11]:
df_credit['Scores'] = df_credit['Credit Score'].rolling(2).sum()
df_credit

,First Name,Last Name,Credit Score,Credit Approval,Card Name,Income,Approval Date,Scores
0,Jacky,White,825,True,Infinite,155000.62,2019-09-13 12:00:00,NaN
1,Jane,Nize,810,True,Golden,120800.88,2019-08-16 05:25:00,1635.0
2,Henry,Tone,780,True,Golden,98000.58,2020-05-06 12:00:00,1590.0
3,Desmond,Black,750,True,Silver,54000.00,2020-05-01 01:00:00,1530.0
4,Eileen,Musk,620,False,Dividend,35000.00,NaT,1370.0

In [15]:
def add_3(x):
 return x + 3
df_raw = pd.DataFrame({'A': [1,3], 'B':[2,4]})
df_raw.apply(add_3)
df_raw['C'] = df_raw['B'].apply(add_3 )
df_raw

   A  B  C
0  1  2  5
1  3  4  7

In [16]:
df_raw.apply(lambda x : x + 5)

   A  B   C
0  6  7  10
1  8  9  12

In [18]:
df_raw['C'] = df_raw['B'].apply(lambda x : x + 5)
df_raw

   A  B  C
0  1  2  7
1  3  4  9